export type Khoroo = {
    name: string;
    lat?: number;
    lng?: number;
};

export type Duureg = {
    name: string;
    lat?: number;
    lng?: number;
    khoroos: Khoroo[];
};

export type Aimag = {
    aimag: string;
    lat?: number;
    lng?: number;
    duuregs: Duureg[];
};

export const MNG: Aimag[] = [
    {
        aimag: 'Улаанбаатар',
        lat: 47.92,
        lng: 106.88,
        duuregs: [
            {
                name: 'Багануур',
                lat: 47.88,
                lng: 106.92,
                khoroos: [
                    { name: '1-р хороо', lat: 47.88, lng: 106.92 },
                    { name: '2-р хороо', lat: 47.881, lng: 106.921 },
                    { name: '3-р хороо', lat: 47.879, lng: 106.919 },
                    { name: '4-р хороо', lat: 47.879, lng: 106.921 },
                    { name: '5-р хороо', lat: 47.881, lng: 106.919 }
                ]
            },
            {
                name: 'Багахангай',
                lat: 48.00,
                lng: 106.75,
                khoroos: [
                    { name: '1-р хороо', lat: 48.00, lng: 106.75 },
                    { name: '2-р хороо', lat: 48.001, lng: 106.751 }
                ]
            },
            {
                name: 'Баянгол',
                lat: 47.9201,
                lng: 106.8643,
                khoroos: [
                    { name: '1-р хороо', lat: 47.9201, lng: 106.8643 },
                    { name: '2-р хороо', lat: 47.9211, lng: 106.8633 },
                    { name: '3-р хороо', lat: 47.9191, lng: 106.8633 },
                    { name: '4-р хороо', lat: 47.9211, lng: 106.8653 },
                    { name: '5-р хороо', lat: 47.9191, lng: 106.8653 },
                    { name: '6-р хороо', lat: 47.9201, lng: 106.8623 },
                    { name: '7-р хороо', lat: 47.9201, lng: 106.8663 },
                    { name: '8-р хороо', lat: 47.9211, lng: 106.8643 },
                    { name: '9-р хороо', lat: 47.9191, lng: 106.8643 },
                    { name: '10-р хороо', lat: 47.9205, lng: 106.8635 },
                    { name: '11-р хороо', lat: 47.9197, lng: 106.8635 },
                    { name: '12-р хороо', lat: 47.9205, lng: 106.8651 },
                    { name: '13-р хороо', lat: 47.9197, lng: 106.8651 },
                    { name: '14-р хороо', lat: 47.9203, lng: 106.8623 },
                    { name: '15-р хороо', lat: 47.9199, lng: 106.8623 },
                    { name: '16-р хороо', lat: 47.9203, lng: 106.8663 },
                    { name: '17-р хороо', lat: 47.9199, lng: 106.8663 },
                    { name: '18-р хороо', lat: 47.9208, lng: 106.8643 },
                    { name: '19-р хороо', lat: 47.9194, lng: 106.8643 },
                    { name: '20-р хороо', lat: 47.9207, lng: 106.8629 },
                    { name: '21-р хороо', lat: 47.9195, lng: 106.8629 },
                    { name: '22-р хороо', lat: 47.9207, lng: 106.8657 },
                    { name: '23-р хороо', lat: 47.9195, lng: 106.8657 }
                ]
            },
            {
                name: 'Баянзүрх',
                lat: 47.9405,
                lng: 106.9351,
                khoroos: [
                    { name: '1-р хороо', lat: 47.9405, lng: 106.9351 },
                    { name: '2-р хороо', lat: 47.9415, lng: 106.9341 },
                    { name: '3-р хороо', lat: 47.9395, lng: 106.9341 },
                    { name: '4-р хороо', lat: 47.9415, lng: 106.9361 },
                    { name: '5-р хороо', lat: 47.9395, lng: 106.9361 },
                    { name: '6-р хороо', lat: 47.9405, lng: 106.9331 },
                    { name: '7-р хороо', lat: 47.9405, lng: 106.9371 },
                    { name: '8-р хороо', lat: 47.9415, lng: 106.9351 },
                    { name: '9-р хороо', lat: 47.9395, lng: 106.9351 },
                    { name: '10-р хороо', lat: 47.9409, lng: 106.9343 },
                    { name: '11-р хороо', lat: 47.9401, lng: 106.9343 },
                    { name: '12-р хороо', lat: 47.9409, lng: 106.9359 },
                    { name: '13-р хороо', lat: 47.9401, lng: 106.9359 },
                    { name: '14-р хороо', lat: 47.9407, lng: 106.9331 },
                    { name: '15-р хороо', lat: 47.9403, lng: 106.9331 },
                    { name: '16-р хороо', lat: 47.9407, lng: 106.9371 },
                    { name: '17-р хороо', lat: 47.9403, lng: 106.9371 },
                    { name: '18-р хороо', lat: 47.9412, lng: 106.9351 },
                    { name: '19-р хороо', lat: 47.9398, lng: 106.9351 },
                    { name: '20-р хороо', lat: 47.9411, lng: 106.9337 },
                    { name: '21-р хороо', lat: 47.9399, lng: 106.9337 },
                    { name: '22-р хороо', lat: 47.9411, lng: 106.9365 },
                    { name: '23-р хороо', lat: 47.9399, lng: 106.9365 },
                    { name: '24-р хороо', lat: 47.9408, lng: 106.9325 },
                    { name: '25-р хороо', lat: 47.9402, lng: 106.9325 },
                    { name: '26-р хороо', lat: 47.9408, lng: 106.9377 },
                    { name: '27-р хороо', lat: 47.9402, lng: 106.9377 },
                    { name: '28-р хороо', lat: 47.9418, lng: 106.9343 },
                    { name: '29-р хороо', lat: 47.9392, lng: 106.9359 },
                    { name: '30-р хороо', lat: 47.9416, lng: 106.9329 },
                    { name: '31-р хороо', lat: 47.9394, lng: 106.9373 },
                    { name: '32-р хороо', lat: 47.9410, lng: 106.9319 },
                    { name: '33-р хороо', lat: 47.9400, lng: 106.9383 },
                    { name: '34-р хороо', lat: 47.9420, lng: 106.9355 },
                    { name: '35-р хороо', lat: 47.9390, lng: 106.9347 },
                    { name: '36-р хороо', lat: 47.9414, lng: 106.9315 },
                    { name: '37-р хороо', lat: 47.9396, lng: 106.9387 },
                    { name: '38-р хороо', lat: 47.9406, lng: 106.9310 },
                    { name: '39-р хороо', lat: 47.9404, lng: 106.9392 },
                    { name: '40-р хороо', lat: 47.9412, lng: 106.9361 },
                    { name: '41-р хороо', lat: 47.9398, lng: 106.9341 },
                    { name: '42-р хороо', lat: 47.9410, lng: 106.9367 },
                    { name: '43-р хороо', lat: 47.9400, lng: 106.9335 }
                ]
            },
            {
                name: 'Налайх',
                lat: 47.88,
                lng: 106.90,
                khoroos: [
                    { name: '1-р хороо', lat: 47.88, lng: 106.90 },
                    { name: '2-р хороо', lat: 47.881, lng: 106.901 },
                    { name: '3-р хороо', lat: 47.879, lng: 106.901 },
                    { name: '4-р хороо', lat: 47.881, lng: 106.899 },
                    { name: '5-р хороо', lat: 47.879, lng: 106.899 },
                    { name: '6-р хороо', lat: 47.8805, lng: 106.8995 },
                    { name: '7-р хороо', lat: 47.8795, lng: 106.9005 },
                    { name: '8-р хороо', lat: 47.8795, lng: 106.8995 }
                ]
            },
            {
                name: 'Сонгинохайрхан',
                lat: 47.9184,
                lng: 106.8159,
                khoroos: [
                    { name: '1-р хороо', lat: 47.9184, lng: 106.8159 },
                    { name: '2-р хороо', lat: 47.9194, lng: 106.8149 },
                    { name: '3-р хороо', lat: 47.9174, lng: 106.8149 },
                    { name: '4-р хороо', lat: 47.9194, lng: 106.8169 },
                    { name: '5-р хороо', lat: 47.9174, lng: 106.8169 },
                    { name: '6-р хороо', lat: 47.9184, lng: 106.8139 },
                    { name: '7-р хороо', lat: 47.9184, lng: 106.8179 },
                    { name: '8-р хороо', lat: 47.9194, lng: 106.8159 },
                    { name: '9-р хороо', lat: 47.9174, lng: 106.8159 },
                    { name: '10-р хороо', lat: 47.9188, lng: 106.8151 },
                    { name: '11-р хороо', lat: 47.9180, lng: 106.8151 },
                    { name: '12-р хороо', lat: 47.9188, lng: 106.8167 },
                    { name: '13-р хороо', lat: 47.9180, lng: 106.8167 },
                    { name: '14-р хороо', lat: 47.9186, lng: 106.8139 },
                    { name: '15-р хороо', lat: 47.9182, lng: 106.8139 },
                    { name: '16-р хороо', lat: 47.9186, lng: 106.8179 },
                    { name: '17-р хороо', lat: 47.9182, lng: 106.8179 },
                    { name: '18-р хороо', lat: 47.9191, lng: 106.8159 },
                    { name: '19-р хороо', lat: 47.9177, lng: 106.8159 },
                    { name: '20-р хороо', lat: 47.9190, lng: 106.8145 },
                    { name: '21-р хороо', lat: 47.9178, lng: 106.8145 },
                    { name: '22-р хороо', lat: 47.9190, lng: 106.8173 },
                    { name: '23-р хороо', lat: 47.9178, lng: 106.8173 },
                    { name: '24-р хороо', lat: 47.9187, lng: 106.8133 },
                    { name: '25-р хороо', lat: 47.9181, lng: 106.8133 },
                    { name: '26-р хороо', lat: 47.9187, lng: 106.8185 },
                    { name: '27-р хороо', lat: 47.9181, lng: 106.8185 },
                    { name: '28-р хороо', lat: 47.9196, lng: 106.8151 },
                    { name: '29-р хороо', lat: 47.9172, lng: 106.8167 },
                    { name: '30-р хороо', lat: 47.9194, lng: 106.8135 },
                    { name: '31-р хороо', lat: 47.9174, lng: 106.8183 },
                    { name: '32-р хороо', lat: 47.9190, lng: 106.8129 },
                    { name: '33-р хороо', lat: 47.9178, lng: 106.8189 },
                    { name: '34-р хороо', lat: 47.9198, lng: 106.8159 },
                    { name: '35-р хороо', lat: 47.9170, lng: 106.8159 },
                    { name: '36-р хороо', lat: 47.9197, lng: 106.8145 },
                    { name: '37-р хороо', lat: 47.9171, lng: 106.8173 },
                    { name: '38-р хороо', lat: 47.9189, lng: 106.8125 },
                    { name: '39-р хороо', lat: 47.9179, lng: 106.8193 },
                    { name: '40-р хороо', lat: 47.9192, lng: 106.8141 },
                    { name: '41-р хороо', lat: 47.9176, lng: 106.8177 },
                    { name: '42-р хороо', lat: 47.9185, lng: 106.8163 },
                    { name: '43-р хороо', lat: 47.9183, lng: 106.8155 }
                ]
            },
            {
                name: 'Сүхбаатар',
                lat: 47.95,
                lng: 106.95,
                khoroos: [
                    { name: '1-р хороо', lat: 47.95, lng: 106.95 },
                    { name: '2-р хороо', lat: 47.951, lng: 106.951 },
                    { name: '3-р хороо', lat: 47.949, lng: 106.951 },
                    { name: '4-р хороо', lat: 47.951, lng: 106.949 },
                    { name: '5-р хороо', lat: 47.949, lng: 106.949 },
                    { name: '6-р хороо', lat: 47.95, lng: 106.947 },
                    { name: '7-р хороо', lat: 47.95, lng: 106.953 },
                    { name: '8-р хороо', lat: 47.951, lng: 106.95 },
                    { name: '9-р хороо', lat: 47.949, lng: 106.95 },
                    { name: '10-р хороо', lat: 47.9505, lng: 106.9485 },
                    { name: '11-р хороо', lat: 47.9495, lng: 106.9485 },
                    { name: '12-р хороо', lat: 47.9505, lng: 106.9515 },
                    { name: '13-р хороо', lat: 47.9495, lng: 106.9515 },
                    { name: '14-р хороо', lat: 47.9503, lng: 106.9467 },
                    { name: '15-р хороо', lat: 47.9497, lng: 106.9467 },
                    { name: '16-р хороо', lat: 47.9503, lng: 106.9533 },
                    { name: '17-р хороо', lat: 47.9497, lng: 106.9533 },
                    { name: '18-р хороо', lat: 47.9508, lng: 106.95 },
                    { name: '19-р хороо', lat: 47.9492, lng: 106.95 },
                    { name: '20-р хороо', lat: 47.9507, lng: 106.9479 }
                ]
            },
            {
                name: 'Хан-Уул',
                lat: 47.8983,
                lng: 106.8589,
                khoroos: [
                    { name: '1-р хороо', lat: 47.8983, lng: 106.8589 },
                    { name: '2-р хороо', lat: 47.8993, lng: 106.8579 },
                    { name: '3-р хороо', lat: 47.8973, lng: 106.8579 },
                    { name: '4-р хороо', lat: 47.8993, lng: 106.8599 },
                    { name: '5-р хороо', lat: 47.8973, lng: 106.8599 },
                    { name: '6-р хороо', lat: 47.8983, lng: 106.8569 },
                    { name: '7-р хороо', lat: 47.8983, lng: 106.8609 },
                    { name: '8-р хороо', lat: 47.8993, lng: 106.8589 },
                    { name: '9-р хороо', lat: 47.8973, lng: 106.8589 },
                    { name: '10-р хороо', lat: 47.8987, lng: 106.8581 },
                    { name: '11-р хороо', lat: 47.8979, lng: 106.8581 },
                    { name: '12-р хороо', lat: 47.8987, lng: 106.8597 },
                    { name: '13-р хороо', lat: 47.8979, lng: 106.8597 },
                    { name: '14-р хороо', lat: 47.8985, lng: 106.8569 },
                    { name: '15-р хороо', lat: 47.8981, lng: 106.8569 },
                    { name: '16-р хороо', lat: 47.8985, lng: 106.8609 },
                    { name: '17-р хороо', lat: 47.8981, lng: 106.8609 },
                    { name: '18-р хороо', lat: 47.8990, lng: 106.8589 },
                    { name: '19-р хороо', lat: 47.8976, lng: 106.8589 },
                    { name: '20-р хороо', lat: 47.8989, lng: 106.8575 },
                    { name: '21-р хороо', lat: 47.8977, lng: 106.8575 },
                    { name: '22-р хороо', lat: 47.8989, lng: 106.8603 },
                    { name: '23-р хороо', lat: 47.8977, lng: 106.8603 },
                    { name: '24-р хороо', lat: 47.8986, lng: 106.8563 },
                    { name: '25-р хороо', lat: 47.8980, lng: 106.8563 }
                ]
            },
            {
                name: 'Чингэлтэй',
                lat: 47.9183,
                lng: 106.9038,
                khoroos: [
                    { name: '1-р хороо', lat: 47.9183, lng: 106.9038 },
                    { name: '2-р хороо', lat: 47.9193, lng: 106.9028 },
                    { name: '3-р хороо', lat: 47.9173, lng: 106.9028 },
                    { name: '4-р хороо', lat: 47.9193, lng: 106.9048 },
                    { name: '5-р хороо', lat: 47.9173, lng: 106.9048 },
                    { name: '6-р хороо', lat: 47.9183, lng: 106.9018 },
                    { name: '7-р хороо', lat: 47.9183, lng: 106.9058 },
                    { name: '8-р хороо', lat: 47.9193, lng: 106.9038 },
                    { name: '9-р хороо', lat: 47.9173, lng: 106.9038 },
                    { name: '10-р хороо', lat: 47.9187, lng: 106.9030 },
                    { name: '11-р хороо', lat: 47.9179, lng: 106.9030 },
                    { name: '12-р хороо', lat: 47.9187, lng: 106.9046 },
                    { name: '13-р хороо', lat: 47.9179, lng: 106.9046 },
                    { name: '14-р хороо', lat: 47.9185, lng: 106.9018 },
                    { name: '15-р хороо', lat: 47.9181, lng: 106.9018 },
                    { name: '16-р хороо', lat: 47.9185, lng: 106.9058 },
                    { name: '17-р хороо', lat: 47.9181, lng: 106.9058 },
                    { name: '18-р хороо', lat: 47.9190, lng: 106.9038 },
                    { name: '19-р хороо', lat: 47.9176, lng: 106.9038 }
                ]
            }
        ]
    },
    {
        aimag: 'Дархан-Уул',
        lat: 49.5,
        lng: 105.97,
        duuregs: [
            {
                name: 'Дархан',
                lat: 49.5,
                lng: 105.97,
                khoroos: [
                    { name: '1-р баг', lat: 49.5, lng: 105.97 },
                    { name: '2-р баг', lat: 49.501, lng: 105.971 }
                ]
            }
        ],
    },
];
